Xinyuan-LilyGO/lilygo-micropython/target/esp32/boards/LILYGO_T5-4.7/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "T5-4.7 (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"